БПКР/src/Catalogs/НастройкиРегламентированныхОтчетов/НастройкиРегламентированныхОтчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НастройкиРегламентированныхОтчетов</name>
  <attributes>
    <name>ВидОтчета</name>
    <type>
      <types>EnumRef.ВидыРегламентированныхОтчетов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СтрокиОтчета</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>4</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Группа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>3</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеСтрокиКырг</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЭтоЗаголовок</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗнакГруппы</name>
      <type>
        <types>EnumRef.ПлюсМинус</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НастройкиСтрок</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>4</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СчетУчета</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
    <attributes>
      <name>Формула</name>
      <type>
        <types>EnumRef.Формулы</types>
      </type>
    </attributes>
    <attributes>
      <name>Знак</name>
      <type>
        <types>EnumRef.ПлюсМинус</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НастройкиСтрокОДДС</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>4</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СчетДт</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетКт</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
    <attributes>
      <name>Формула</name>
      <type>
        <types>EnumRef.Формулы</types>
      </type>
    </attributes>
    <attributes>
      <name>Знак</name>
      <type>
        <types>EnumRef.ПлюсМинус</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НастройкиСтрокОДДСПоСтатьям</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>4</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяДвиженияДенежныхСредств</name>
      <type>
        <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
      </type>
    </attributes>
    <attributes>
      <name>Формула</name>
      <type>
        <types>EnumRef.Формулы</types>
      </type>
    </attributes>
    <attributes>
      <name>Знак</name>
      <type>
        <types>EnumRef.ПлюсМинус</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НастройкиСтрокОИК</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>4</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СчетУчета</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
    <attributes>
      <name>Формула</name>
      <type>
        <types>EnumRef.Формулы</types>
      </type>
    </attributes>
    <attributes>
      <name>Знак</name>
      <type>
        <types>EnumRef.ПлюсМинус</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидКапитала</name>
      <type>
        <types>EnumRef.ВидыКапитала</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СчетДт</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетКт</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

БПКР/src/Enums/Формулы/Формулы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Формулы</name>
  <enumValues>
    <name>СальдоДт</name>
  </enumValues>
  <enumValues>
    <name>СальдоКт</name>
  </enumValues>
  <enumValues>
    <name>ОборотыДт</name>
  </enumValues>
  <enumValues>
    <name>ОборотыКт</name>
  </enumValues>
  <enumValues>
    <name>ОборотыДтКт</name>
  </enumValues>
  <enumValues>
    <name>СальдоНачальноеДт</name>
  </enumValues>
  <enumValues>
    <name>СальдоНачальноеКт</name>
  </enumValues>
  <enumValues>
    <name>СальдоКонечноеДт</name>
  </enumValues>
  <enumValues>
    <name>СальдоКонечноеКт</name>
  </enumValues>
  <enumValues>
    <name>ОсобаяФормула</name>
  </enumValues>
</mdclass:Enum>

БПКР/src/Enums/ПлюсМинус/ПлюсМинус.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПлюсМинус</name>
  <enumValues>
    <name>Плюс</name>
  </enumValues>
  <enumValues>
    <name>Минус</name>
  </enumValues>
</mdclass:Enum>

БПКР/src/Catalogs/НастройкиРегламентированныхОтчетов/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьНастройкиБаланс() Экспорт
	
	СправочникМенеджер = Справочники.НастройкиРегламентированныхОтчетов;
	
	КлассификаторXML = СправочникМенеджер.ПолучитьМакет("МакетЗаполненияНастройкиБаланс").ПолучитьТекст();
	КлассификаторТаблица  = ОбщегоНазначения.ПрочитатьXMLВТаблицу(КлассификаторXML).Данные;
	
	// Заполнение НастройкиСтрок.
	Для Каждого СтрокаТаблицыЗначений Из КлассификаторТаблица Цикл 
		КодСтроки = СокрЛП(СтрокаТаблицыЗначений.КодСтроки);
		СчетУчета = СокрЛП(СтрокаТаблицыЗначений.СчетУчета);
		Формула = СокрЛП(СтрокаТаблицыЗначений.Формула);
		Знак = СокрЛП(СтрокаТаблицыЗначений.Знак);
		ЭтоЗаголовок = СокрЛП(СтрокаТаблицыЗначений.ЭтоЗаголовок);
		
		// Пропуск не настраеваемых строк.
		Если ВРег(ЭтоЗаголовок) = "ИСТИНА"
			Или Формула = "" Тогда 
			Продолжить;
		КонецЕсли;
		
		СтрокаТабличнойЧасти = НастройкиСтрок.Добавить();
		СтрокаТабличнойЧасти.КодСтроки = КодСтроки;
		СтрокаТабличнойЧасти.СчетУчета = ПланыСчетов.Хозрасчетный.НайтиПоКоду(СчетУчета);
		СтрокаТабличнойЧасти.Формула = ?(ЗначениеЗаполнено(Формула), Перечисления.Формулы[Формула], Перечисления.Формулы.ПустаяСсылка());
		СтрокаТабличнойЧасти.Знак = ?(ЗначениеЗаполнено(Знак), Перечисления.ПлюсМинус[Знак], Перечисления.ПлюсМинус.ПустаяСсылка());
	КонецЦикла;
	
	// Заполнение СтрокиОтчета.
	КлассификаторТаблица.Свернуть("КодСтроки, Группа, НаименованиеСтроки, НаименованиеСтрокиКырг, ЭтоЗаголовок");

	Для Каждого СтрокаТаблицыЗначений Из КлассификаторТаблица Цикл 
		КодСтроки = СокрЛП(СтрокаТаблицыЗначений.КодСтроки);
		Группа = СокрЛП(СтрокаТаблицыЗначений.Группа);
		НаименованиеСтроки = СокрЛП(СтрокаТаблицыЗначений.НаименованиеСтроки);
		НаименованиеСтрокиКырг = СокрЛП(СтрокаТаблицыЗначений.НаименованиеСтрокиКырг);
		ЭтоЗаголовок = СокрЛП(СтрокаТаблицыЗначений.ЭтоЗаголовок);
		
		СтрокаТабличнойЧасти = СтрокиОтчета.Добавить();
		СтрокаТабличнойЧасти.КодСтроки = КодСтроки;
		СтрокаТабличнойЧасти.Группа = Группа;
		СтрокаТабличнойЧасти.НаименованиеСтроки = НаименованиеСтроки;
		СтрокаТабличнойЧасти.НаименованиеСтрокиКырг = НаименованиеСтрокиКырг;
		СтрокаТабличнойЧасти.ЭтоЗаголовок = ?(ВРег(ЭтоЗаголовок) = "ИСТИНА", Истина, Ложь);
	КонецЦикла;
	
	ЗаполнитьКлючиСвязи("НастройкиСтрок");

КонецПроцедуры

Процедура ЗаполнитьНастройкиОПУ() Экспорт
	
	СправочникМенеджер = Справочники.НастройкиРегламентированныхОтчетов;
	
	КлассификаторXML = СправочникМенеджер.ПолучитьМакет("МакетЗаполненияНастройкиОПУ").ПолучитьТекст();
	КлассификаторТаблица  = ОбщегоНазначения.ПрочитатьXMLВТаблицу(КлассификаторXML).Данные;
	
	// Заполнение НастройкиСтрок.
	Для Каждого СтрокаТаблицыЗначений Из КлассификаторТаблица Цикл 
		КодСтроки = СокрЛП(СтрокаТаблицыЗначений.КодСтроки);
		СчетУчета = СокрЛП(СтрокаТаблицыЗначений.СчетУчета);
		Формула = СокрЛП(СтрокаТаблицыЗначений.Формула);
		Знак = СокрЛП(СтрокаТаблицыЗначений.Знак);
		ЭтоЗаголовок = СокрЛП(СтрокаТаблицыЗначений.ЭтоЗаголовок);
		
		// Пропуск не настраеваемых строк.
		Если ВРег(ЭтоЗаголовок) = "ИСТИНА"
			Или Формула = "" Тогда 
			Продолжить;
		КонецЕсли;

		СтрокаТабличнойЧасти = НастройкиСтрок.Добавить();
		СтрокаТабличнойЧасти.КодСтроки = КодСтроки;
		СтрокаТабличнойЧасти.СчетУчета = ПланыСчетов.Хозрасчетный.НайтиПоКоду(СчетУчета);
		СтрокаТабличнойЧасти.Формула = ?(ЗначениеЗаполнено(Формула), Перечисления.Формулы[Формула], Перечисления.Формулы.ПустаяСсылка());
		СтрокаТабличнойЧасти.Знак = ?(ЗначениеЗаполнено(Знак), Перечисления.ПлюсМинус[Знак], Перечисления.ПлюсМинус.ПустаяСсылка());
	КонецЦикла;
	
	// Заполнение СтрокиОтчета.
	КлассификаторТаблица.Свернуть("КодСтроки, Группа, НаименованиеСтроки, НаименованиеСтрокиКырг, ЭтоЗаголовок, ЗнакГруппы");

	Для Каждого СтрокаТаблицыЗначений Из КлассификаторТаблица Цикл 
		КодСтроки = СокрЛП(СтрокаТаблицыЗначений.КодСтроки);
		Группа = СокрЛП(СтрокаТаблицыЗначений.Группа);
		НаименованиеСтроки = СокрЛП(СтрокаТаблицыЗначений.НаименованиеСтроки);
		НаименованиеСтрокиКырг = СокрЛП(СтрокаТаблицыЗначений.НаименованиеСтрокиКырг);
		ЭтоЗаголовок = СокрЛП(СтрокаТаблицыЗначений.ЭтоЗаголовок);
		ЗнакГруппы = СокрЛП(СтрокаТаблицыЗначений.ЗнакГруппы);
		
		СтрокаТабличнойЧасти = СтрокиОтчета.Добавить();
		СтрокаТабличнойЧасти.КодСтроки = КодСтроки;
		СтрокаТабличнойЧасти.Группа = Группа;
		СтрокаТабличнойЧасти.НаименованиеСтроки = НаименованиеСтроки;
		СтрокаТабличнойЧасти.НаименованиеСтрокиКырг = НаименованиеСтрокиКырг;
		СтрокаТабличнойЧасти.ЭтоЗаголовок = ?(ВРег(ЭтоЗаголовок) = "ИСТИНА", Истина, Ложь);
		СтрокаТабличнойЧасти.ЗнакГруппы = ?(ЗначениеЗаполнено(ЗнакГруппы), Перечисления.ПлюсМинус[ЗнакГруппы], Перечисления.ПлюсМинус.ПустаяСсылка());
	КонецЦикла;
	
	ЗаполнитьКлючиСвязи("НастройкиСтрок");
	
КонецПроцедуры

Процедура ЗаполнитьНастройкиОДДС() Экспорт
	
	СправочникМенеджер = Справочники.НастройкиРегламентированныхОтчетов;
	
	КлассификаторXML = СправочникМенеджер.ПолучитьМакет("МакетЗаполненияНастройкиОДДС").ПолучитьТекст();
	КлассификаторТаблица  = ОбщегоНазначения.ПрочитатьXMLВТаблицу(КлассификаторXML).Данные;
	
	// Заполнение НастройкиСтрок.
	Для Каждого СтрокаТаблицыЗначений Из КлассификаторТаблица Цикл 
		КодСтроки = СокрЛП(СтрокаТаблицыЗначений.КодСтроки);
		СчетДт = СокрЛП(СтрокаТаблицыЗначений.СчетДт);
		СчетКт = СокрЛП(СтрокаТаблицыЗначений.СчетКт);
		Формула = СокрЛП(СтрокаТаблицыЗначений.Формула);
		Знак = СокрЛП(СтрокаТаблицыЗначений.Знак);
		ЭтоЗаголовок = СокрЛП(СтрокаТаблицыЗначений.ЭтоЗаголовок);
		
		// Пропуск не настраеваемых строк.
		Если ВРег(ЭтоЗаголовок) = "ИСТИНА"
			Или Формула = "" Тогда 
			Продолжить;
		КонецЕсли;

		СтрокаТабличнойЧасти = НастройкиСтрокОДДС.Добавить();
		СтрокаТабличнойЧасти.КодСтроки = КодСтроки;
		СтрокаТабличнойЧасти.СчетДт = ПланыСчетов.Хозрасчетный.НайтиПоКоду(СчетДт);
		СтрокаТабличнойЧасти.СчетКт = ПланыСчетов.Хозрасчетный.НайтиПоКоду(СчетКт);
		СтрокаТабличнойЧасти.Формула = ?(ЗначениеЗаполнено(Формула), Перечисления.Формулы[Формула], Перечисления.Формулы.ПустаяСсылка());
		СтрокаТабличнойЧасти.Знак = ?(ЗначениеЗаполнено(Знак), Перечисления.ПлюсМинус[Знак], Перечисления.ПлюсМинус.ПустаяСсылка());
	КонецЦикла;
	
	// Заполнение СтрокиОтчета.
	КлассификаторТаблица.Свернуть("КодСтроки, Группа, НаименованиеСтроки, НаименованиеСтрокиКырг, ЭтоЗаголовок, ЗнакГруппы");

	Для Каждого СтрокаТаблицыЗначений Из КлассификаторТаблица Цикл 
		КодСтроки = СокрЛП(СтрокаТаблицыЗначений.КодСтроки);
		Группа = СокрЛП(СтрокаТаблицыЗначений.Группа);
		НаименованиеСтроки = СокрЛП(СтрокаТаблицыЗначений.НаименованиеСтроки);
		НаименованиеСтрокиКырг = СокрЛП(СтрокаТаблицыЗначений.НаименованиеСтрокиКырг);
		ЭтоЗаголовок = СокрЛП(СтрокаТаблицыЗначений.ЭтоЗаголовок);
		ЗнакГруппы = СокрЛП(СтрокаТаблицыЗначений.ЗнакГруппы);
		
		СтрокаТабличнойЧасти = СтрокиОтчета.Добавить();
		СтрокаТабличнойЧасти.КодСтроки = КодСтроки;
		СтрокаТабличнойЧасти.Группа = Группа;
		СтрокаТабличнойЧасти.НаименованиеСтроки = НаименованиеСтроки;
		СтрокаТабличнойЧасти.НаименованиеСтрокиКырг = НаименованиеСтрокиКырг;
		СтрокаТабличнойЧасти.ЭтоЗаголовок = ?(ВРег(ЭтоЗаголовок) = "ИСТИНА", Истина, Ложь);
		СтрокаТабличнойЧасти.ЗнакГруппы = ?(ЗначениеЗаполнено(ЗнакГруппы), Перечисления.ПлюсМинус[ЗнакГруппы], Перечисления.ПлюсМинус.ПустаяСсылка());
	КонецЦикла;
	
	ЗаполнитьКлючиСвязи("НастройкиСтрокОДДС");
	
КонецПроцедуры

Процедура ЗаполнитьНастройкиОДДСПоСтатьям() Экспорт
	
	СправочникМенеджер = Справочники.НастройкиРегламентированныхОтчетов;
	
	КлассификаторXML = СправочникМенеджер.ПолучитьМакет("МакетЗаполненияНастройкиОДДС").ПолучитьТекст();
	КлассификаторТаблица  = ОбщегоНазначения.ПрочитатьXMLВТаблицу(КлассификаторXML).Данные;
	// Заполнение СтрокиОтчета.
	КлассификаторТаблица.Свернуть("КодСтроки, Группа, НаименованиеСтроки, НаименованиеСтрокиКырг, ЭтоЗаголовок, ЗнакГруппы");

	Для Каждого СтрокаТаблицыЗначений Из КлассификаторТаблица Цикл 
		КодСтроки = СокрЛП(СтрокаТаблицыЗначений.КодСтроки);
		Группа = СокрЛП(СтрокаТаблицыЗначений.Группа);
		НаименованиеСтроки = СокрЛП(СтрокаТаблицыЗначений.НаименованиеСтроки);
		НаименованиеСтрокиКырг = СокрЛП(СтрокаТаблицыЗначений.НаименованиеСтрокиКырг);
		ЭтоЗаголовок = СокрЛП(СтрокаТаблицыЗначений.ЭтоЗаголовок);
		ЗнакГруппы = СокрЛП(СтрокаТаблицыЗначений.ЗнакГруппы);
		
		СтрокаТабличнойЧасти = СтрокиОтчета.Добавить();
		СтрокаТабличнойЧасти.КодСтроки = КодСтроки;
		СтрокаТабличнойЧасти.Группа = Группа;
		СтрокаТабличнойЧасти.НаименованиеСтроки = НаименованиеСтроки;
		СтрокаТабличнойЧасти.НаименованиеСтрокиКырг = НаименованиеСтрокиКырг;
		СтрокаТабличнойЧасти.ЭтоЗаголовок = ?(ВРег(ЭтоЗаголовок) = "ИСТИНА", Истина, Ложь);
		СтрокаТабличнойЧасти.ЗнакГруппы = ?(ЗначениеЗаполнено(ЗнакГруппы), Перечисления.ПлюсМинус[ЗнакГруппы], Перечисления.ПлюсМинус.ПустаяСсылка());
	КонецЦикла;
	
	// Заполнение НастройкиСтрок.
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтатьиДвиженияДенежныхСредств.КодСтроки КАК КодСтроки,
		|	СтатьиДвиженияДенежныхСредств.Ссылка КАК СтатьяДвиженияДенежныхСредств,
		|	ЗНАЧЕНИЕ(Перечисление.Формулы.ОборотыДтКт) КАК Формула,
		|	ЗНАЧЕНИЕ(Перечисление.ПлюсМинус.Плюс) КАК Знак
		|ИЗ
		|	Справочник.СтатьиДвиженияДенежныхСредств КАК СтатьиДвиженияДенежныхСредств
		|ГДЕ
		|	НЕ СтатьиДвиженияДенежныхСредств.ЭтоГруппа
		|	И НЕ СтатьиДвиженияДенежныхСредств.ПометкаУдаления
		|	И НЕ СтатьиДвиженияДенежныхСредств.КодСтроки = """"
		|
		|УПОРЯДОЧИТЬ ПО
		|	КодСтроки";
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтрокаТабличнойЧасти = НастройкиСтрокОДДСПоСтатьям.Добавить();	
		ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, ВыборкаДетальныеЗаписи);
	КонецЦикла;

	ЗаполнитьКлючиСвязи("НастройкиСтрокОДДСПоСтатьям");
	
КонецПроцедуры

Процедура ЗаполнитьНастройкиОИК() Экспорт
	
	СправочникМенеджер = Справочники.НастройкиРегламентированныхОтчетов;
	
	КлассификаторXML = СправочникМенеджер.ПолучитьМакет("МакетЗаполненияНастройкиОИК").ПолучитьТекст();
	КлассификаторТаблица  = ОбщегоНазначения.ПрочитатьXMLВТаблицу(КлассификаторXML).Данные;
	
	// Заполнение НастройкиСтрок.
	Для Каждого СтрокаТаблицыЗначений Из КлассификаторТаблица Цикл 
		КодСтроки = СокрЛП(СтрокаТаблицыЗначений.КодСтроки);
		СчетУчета = СокрЛП(СтрокаТаблицыЗначений.СчетУчета);
		Формула = СокрЛП(СтрокаТаблицыЗначений.Формула);
		Знак = СокрЛП(СтрокаТаблицыЗначений.Знак);
		ВидКапитала = СокрЛП(СтрокаТаблицыЗначений.ВидКапитала);
		ЭтоЗаголовок = СокрЛП(СтрокаТаблицыЗначений.ЭтоЗаголовок);
		СчетДт = СокрЛП(СтрокаТаблицыЗначений.СчетДт);
		СчетКт = СокрЛП(СтрокаТаблицыЗначений.СчетКт);
		
		// Пропуск не настраеваемых строк.
		Если ВРег(ЭтоЗаголовок) = "ИСТИНА"
			Или Формула = "" Тогда 
			Продолжить;
		КонецЕсли;

		СтрокаТабличнойЧасти = НастройкиСтрокОИК.Добавить();
		СтрокаТабличнойЧасти.КодСтроки = КодСтроки;
		СтрокаТабличнойЧасти.СчетУчета = ПланыСчетов.Хозрасчетный.НайтиПоКоду(СчетУчета);
		СтрокаТабличнойЧасти.Формула = ?(ЗначениеЗаполнено(Формула), Перечисления.Формулы[Формула], Перечисления.Формулы.ПустаяСсылка());
		СтрокаТабличнойЧасти.Знак = ?(ЗначениеЗаполнено(Знак), Перечисления.ПлюсМинус[Знак], Перечисления.ПлюсМинус.ПустаяСсылка());
		СтрокаТабличнойЧасти.ВидКапитала = ?(ЗначениеЗаполнено(ВидКапитала), Перечисления.ВидыКапитала[ВидКапитала], Перечисления.ВидыКапитала.ПустаяСсылка());
		СтрокаТабличнойЧасти.СчетДт = ПланыСчетов.Хозрасчетный.НайтиПоКоду(СчетДт);
		СтрокаТабличнойЧасти.СчетКт = ПланыСчетов.Хозрасчетный.НайтиПоКоду(СчетКт);
	КонецЦикла;
	
	// Заполнение СтрокиОтчета.
	КлассификаторТаблица.Свернуть("КодСтроки, Группа, НаименованиеСтроки, НаименованиеСтрокиКырг, ЭтоЗаголовок, ЗнакГруппы");

	Для Каждого СтрокаТаблицыЗначений Из КлассификаторТаблица Цикл 
		КодСтроки = СокрЛП(СтрокаТаблицыЗначений.КодСтроки);
		Группа = СокрЛП(СтрокаТаблицыЗначений.Группа);
		НаименованиеСтроки = СокрЛП(СтрокаТаблицыЗначений.НаименованиеСтроки);
		НаименованиеСтрокиКырг = СокрЛП(СтрокаТаблицыЗначений.НаименованиеСтрокиКырг);
		ЭтоЗаголовок = СокрЛП(СтрокаТаблицыЗначений.ЭтоЗаголовок);
		ЗнакГруппы = СокрЛП(СтрокаТаблицыЗначений.ЗнакГруппы);
		
		СтрокаТабличнойЧасти = СтрокиОтчета.Добавить();
		СтрокаТабличнойЧасти.КодСтроки = КодСтроки;
		СтрокаТабличнойЧасти.Группа = Группа;
		СтрокаТабличнойЧасти.НаименованиеСтроки = НаименованиеСтроки;
		СтрокаТабличнойЧасти.НаименованиеСтрокиКырг = НаименованиеСтрокиКырг;
		СтрокаТабличнойЧасти.ЭтоЗаголовок = ?(ВРег(ЭтоЗаголовок) = "ИСТИНА", Истина, Ложь);
		СтрокаТабличнойЧасти.ЗнакГруппы = ?(ЗначениеЗаполнено(ЗнакГруппы), Перечисления.ПлюсМинус[ЗнакГруппы], Перечисления.ПлюсМинус.ПустаяСсылка());
	КонецЦикла;
	
	ЗаполнитьКлючиСвязи("НастройкиСтрокОИК");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьКлючиСвязи(ИмяПодчиненнойТабличнойЧасти)

	// Формирование ключа связи.
	КлючСвязи = 1;
	Для Каждого СтрокаТабличнойЧасти Из СтрокиОтчета Цикл 
		СтрокаТабличнойЧасти.КлючСвязи = КлючСвязи;
		НайденныеСтроки = ЭтотОбъект[ИмяПодчиненнойТабличнойЧасти].НайтиСтроки(Новый Структура("КодСтроки", СтрокаТабличнойЧасти.КодСтроки));
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл 
			НайденнаяСтрока.КлючСвязи = КлючСвязи;
		КонецЦикла;	
		
		КлючСвязи = КлючСвязи + 1;
	КонецЦикла;	

КонецПроцедуры // ЗаполнитьКлючСвязи()
	
#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
